app/controllers/movies_controller.rb

  def resource_list
    @movies = Movie.all
    @seasons = Season.all
---
SELECT "movies".* FROM "movies"
SELECT "seasons".* FROM "seasons"