app/controllers/seasons_controller.rb

  def index
    @seasons = Season.includes(:episodes).all
---
SELECT "episodes".* FROM "episodes" WHERE "episodes"."season_id" IN (1)
SELECT "seasons".* FROM "seasons"