app/controllers/users_controller.rb

SELECT "movies".* FROM "movies" INNER JOIN "movie_purchase_mappings" ON "movies"."id" = "movie_purchase_mappings"."movie_id" WHERE "movie_purchase_mappings"."library_id" = 1 AND (id = 1 and purchase_time >= '2020-04-24 07:40:22.587223') ORDER BY "movies"."id" DESC LIMIT 1
SELECT "seasons".* FROM "seasons" INNER JOIN "season_purchase_mappings" ON "seasons"."id" = "season_purchase_mappings"."season_id" WHERE "season_purchase_mappings"."library_id" = 1 AND (purchase_time >= '2020-04-23 20:52:54.240588')
---
  def find_item(content_type, content_id, library)
    if content_type == "movie"
      content = library.movies.where(id: content_id)
    else
      content = library.seasons.where(id: content_id)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def purchase
    #expects to have two parameters content_type either movie or season and content_id
    @user = User.find(params["id"].to_i)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def all_contents
    user_id = params[:id].to_i
    @user = User.find(user_id)